Open-CMSIS-Pack/pack-examples/STM32U0xx_DFP/Keil.STM32U0xx_DFP.pdsc
        <!-- *************************  Device 'STM32U031C8U6  ***************************** -->
        <device Dname="STM32U031C8Ux">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_64k.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U031R8T6  ***************************** -->
        <device Dname="STM32U031R8Tx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_64k.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U031R8I6  ***************************** -->
        <device Dname="STM32U031R8Ix">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_64k.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U031G8Y6TR  *************************** -->
        <device Dname="STM32U031G8YxT">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_64k.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="CSP" n="27"/>
        </device>

        <!-- ################################### 32 KB ################################## -->
        <!-- *************************  Device 'STM32U031F6P6  ***************************** -->
        <device Dname="STM32U031F6Px">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00008000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_32k.FLM"  start="0x08000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32U031K6U6  ***************************** -->
        <device Dname="STM32U031K6Ux">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00008000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_32k.FLM"  start="0x08000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32U031C6T6  ***************************** -->
        <device Dname="STM32U031C6Tx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00008000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_32k.FLM"  start="0x08000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U031C6U6  ***************************** -->
        <device Dname="STM32U031C6Ux">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00008000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_32k.FLM"  start="0x08000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U031R6T6  ***************************** -->
        <device Dname="STM32U031R6Tx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00008000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_32k.FLM"  start="0x08000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U031R6I6  ***************************** -->
        <device Dname="STM32U031R6Ix">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00008000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_32k.FLM"  start="0x08000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U031G6Y6TR  *************************** -->
        <device Dname="STM32U031G6YxT">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00008000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_32k.FLM"  start="0x08000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="CSP" n="27"/>
        </device>

        <!-- ################################### 16 KB ################################## -->
        <!-- *************************  Device 'STM32U031F4P6  ***************************** -->
        <device Dname="STM32U031F4Px">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00004000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_16k.FLM"  start="0x08000000" size="0x00004000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32U031K6U6  ***************************** -->
        <device Dname="STM32U031K4Ux">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00004000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_16k.FLM"  start="0x08000000" size="0x00004000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFN" n="32"/>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'STM32U073'  **************************** -->
      <subFamily DsubFamily="STM32U073">
        <compile define="STM32U073xx"/>
        <debug svd="CMSIS/SVD/STM32U073.svd"/>

        <book name="https://www.st.com/resource/en/reference_manual/DM00908031.pdf"  title="STM32U0xx Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/DM01038355.pdf" title="STM32U073x8/B/C Datasheet"/>

        <debugvars configfile="CMSIS/Debug/STM32U0x1_0x3.dbgconf" version="1.0.0">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB1FZR   = 0x00000000;   // DbgMCU_APB1FZR:  DBGMCU APB1 freeze register
          __var DbgMCU_APB2FZR   = 0x00000000;   // DbgMCU_APB2FZR:  DBGMCU APB2 freeze register
        </debugvars>

        <memory name="SRAM1"    access="rwx" start="0x20000000" size="0x00008000" default="1" init="0" />
        <memory name="SRAM2"    access="rwx" start="0x20002000" size="0x00002000" default="0" init="0" />

        <!-- ################################### 64 KB ################################## -->
        <!-- *************************  Device 'STM32U073K8U6  ***************************** -->
        <device Dname="STM32U073K8Ux">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_64k.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32U073C8T6  ***************************** -->
        <device Dname="STM32U073C8Tx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_64k.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U073C8U6  ***************************** -->
        <device Dname="STM32U073C8Ux">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_64k.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U073R8T6  ***************************** -->
        <device Dname="STM32U073R8Tx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_64k.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U073R8I6  ***************************** -->
        <device Dname="STM32U073R8Ix">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_64k.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U073M8T6  ***************************** -->
        <device Dname="STM32U073M8Tx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_64k.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

