Open-CMSIS-Pack/pack-examples/STM32U0xx_DFP/Keil.STM32U0xx_DFP.pdsc
          <feature type="QFP" n="80"/>
        </device>

        <!-- *************************  Device 'STM32U073M8I6  ***************************** -->
        <device Dname="STM32U073M8Ix">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_64k.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="BGA" n="81"/>
        </device>

        <!-- *************************  Device 'STM32U073H8Y6TR  *************************** -->
        <device Dname="STM32U073H8YxT">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_64k.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="CSP" n="42"/>
        </device>

        <!-- ################################### 128 KB ################################## -->
        <!-- *************************  Device 'STM32U073KBU6  ***************************** -->
        <device Dname="STM32U073KBUx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_128k.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32U073CBT6  ***************************** -->
        <device Dname="STM32U073CBTx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_128k.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U073CBU6  ***************************** -->
        <device Dname="STM32U073CBUx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_128k.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U073RBT6  ***************************** -->
        <device Dname="STM32U073RBTx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_128k.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U073RBI6  ***************************** -->
        <device Dname="STM32U073RBIx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_128k.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U073MBT6  ***************************** -->
        <device Dname="STM32U073MBTx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_128k.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="80"/>
        </device>

        <!-- *************************  Device 'STM32U073MBI6  ***************************** -->
        <device Dname="STM32U073MBIx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_128k.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="BGA" n="81"/>
        </device>

        <!-- *************************  Device 'STM32U073HBY6TR  *************************** -->
        <device Dname="STM32U073HBYxT">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_128k.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="CSP" n="42"/>
        </device>

        <!-- ################################### 256 KB ################################## -->
        <!-- *************************  Device 'STM32U073KCU6  ***************************** -->
        <device Dname="STM32U073KCUx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32U073CCT6  ***************************** -->
        <device Dname="STM32U073CCTx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U073CCU6  ***************************** -->
        <device Dname="STM32U073CCUx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U073RCT6  ***************************** -->
        <device Dname="STM32U073RCTx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U073RCI6  ***************************** -->
        <device Dname="STM32U073RCIx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U073MCT6  ***************************** -->
        <device Dname="STM32U073MCTx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

