Open-CMSIS-Pack/pack-examples/STM32U0xx_DFP/Keil.STM32U0xx_DFP.pdsc
          <feature type="QFP" n="80"/>
        </device>

        <!-- *************************  Device 'STM32U073MCI6  ***************************** -->
        <device Dname="STM32U073MCIx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="BGA" n="81"/>
        </device>

        <!-- *************************  Device 'STM32U073HCY6TR  *************************** -->
        <device Dname="STM32U073HCYxT">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="CSP" n="42"/>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'STM32U083'  **************************** -->
      <subFamily DsubFamily="STM32U083">
        <compile define="STM32U083xx"/>
        <debug svd="CMSIS/SVD/STM32U083.svd"/>

        <book name="https://www.st.com/resource/en/reference_manual/DM00908031.pdf"  title="STM32U0xx Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/DM01017053.pdf" title="STM32U083xC Datasheet"/>

        <debugvars configfile="CMSIS/Debug/STM32U0x1_0x3.dbgconf" version="1.0.0">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB1FZR   = 0x00000000;   // DbgMCU_APB1FZR:  DBGMCU APB1 freeze register
          __var DbgMCU_APB2FZR   = 0x00000000;   // DbgMCU_APB2FZR:  DBGMCU APB2 freeze register
        </debugvars>

        <memory name="SRAM1"    access="rwx" start="0x20000000" size="0x00008000" default="1" init="0" />
        <memory name="SRAM2"    access="rwx" start="0x20002000" size="0x00002000" default="0" init="0" />

        <!-- ################################### 256 KB ################################## -->
        <!-- *************************  Device 'STM32U083KCU6  ***************************** -->
        <device Dname="STM32U083KCUx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32U083CCT6  ***************************** -->
        <device Dname="STM32U083CCTx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U083CCU6  ***************************** -->
        <device Dname="STM32U083CCUx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U083RCT6  ***************************** -->
        <device Dname="STM32U083RCTx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U083RCI6  ***************************** -->
        <device Dname="STM32U083RCIx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U083MCT6  ***************************** -->
        <device Dname="STM32U083MCTx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="QFP" n="80"/>
        </device>

        <!-- *************************  Device 'STM32U083MCI6  ***************************** -->
        <device Dname="STM32U083MCIx">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="BGA" n="81"/>
        </device>

        <!-- *************************  Device 'STM32U083HCY6TR  *************************** -->
        <device Dname="STM32U083HCYxT">
          <memory name="Flash"  access="rx"                start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U0xx_256k.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x2000" default="1" />

          <feature type="CSP" n="42"/>
        </device>

      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Device Conditions -->
    <condition id="STM32U0">
      <description>STMicroelectronics STM32U0 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32U0*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32U0 CMSIS">
      <description>STMicroelectronics STM32U0 Device and CMSIS-CORE</description>
      <require condition="STM32U0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- CubeMX Generator -->
    <component generator="CubeMX" Cclass="Device" Cgroup="CubeMX" Cversion="1.0.0" condition="STM32U0 CMSIS">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_CUBE_MX
        #define CMSIS_device_header "stm32u0xx.h"
      </RTE_Components_h>
      <files>
        <file category="doc" name="https://github.com/Open-CMSIS-Pack/cmsis-toolbox/tree/main/docs/CubeMX.md"/>
      </files>
    </component>
  </components>

</package>
